clear 
clc
%==========================================
% Z(k+3)=-0.9*Z(k+2)-0.15*Z(k+1)-0.02*z(k)+0.7*u(k+2)-1.5*u(k+1)+e(k)
%e(k+2)+1.0*e(k+1)+0.41*e(k)=r*v(k+2)
%==========产生M 序列作为输入=============== 
x=[0 1 0 1 1 0 1 1 1];  %initial value 
n=405; %n为脉冲数目
M=[];	%存放M 序列
for i=1:n 
    temp=xor(x(4),x(9));
    M(i)=x(9);
for j=9:-1:2
x(j)=x(j-1);
 end
 x(1)=temp;
end
%===========产生均值为0，方差为1 的高斯白噪声=============
v=randn(1,405);
e=[]; 
e(1)=0.3; 
e(2)=0.7;
r=0.9;    %控制信噪比
for i=3:405
e(i)=-1.0*e(i-1)-0.41*e(i-2)+r*v(i);
end
%=================产生观测序列===================
z=[]; 
z(1)=-1; 
z(2)=0; 
z(3)=1.5;
for i=4:405
z(i)=-0.9*z(i-1)-0.15*z(i-2)-0.02*z(i-3)+0.7*M(i-1)-1.5*M(i-2)+e(i);
end
%================第一级辨识  辅助模型参数辨识==================
H=zeros(400,9);
for i=1:400
    H(i,1)=-z(i+4); 
    H(i,2)=-z(i+3); 
    H(i,3)=-z(i+2);
    H(i,4)=-z(i+1);
    H(i,5)=-z(i);
    H(i,6)=M(i+4);
    H(i,7)=M(i+3);
    H(i,8)=M(i+2); 
    H(i,9)=M(i+1);
end
disp('第一级 辅助模型参数 e1 e2 e3 e3 e4 f1 f2 f3 f4 辨识结果：') 
E=inv(H'*H)*H'*(z(6:405))'
e1=E(1);
e2=E(2);
e3=E(3); 
e4=E(4); 
e5=E(5);
f1=E(6); 
f2=E(7); 
f3=E(8); 
f4=E(9);
%=================第二级辨识  过程模型参数辨识====================
z2=[f1;f2;f3;f4;0;0;0]; 
H2=[ 0  0   0	1	0;

    -f1 0   0	e1 1;

    -f2 -f1 0	e2 e1;

    -f3 -f2 -f1 e3 e2;

    -f4 -f3 -f2 e4 e3;

     0 -f4 -f3 e5 e4;

     0 0 -f4 0 e5;];


disp('第二级  过程模型参数 a1 a2 a3 b1 b2 辨识结果：') 
E2=inv(H2'*H2)*H2'*z2
a1=E2(1); 
a2=E2(2); 
a3=E2(3); 
b1=E2(4); 
b2=E2(5);
%================第三级辨识  噪声模型参数辨识=======================
z3=[e1-a1;e2-a2;e3-a3;e4;e5;f2-b2;f3;f4]; 
H3=[1	 0;
     a1  1; 
     a2  a1; 
     a3  a2;
     0	 a3; 
     b1  0; 
     b2  b1;
     0	 b2;];
disp('第三级 噪声模型参数 c1 c2 辨识结果：') 
E3=inv(H3'*H3)*H3'*z3
disp('参数a1 a2 b1 b2的估计结果：') 
Theta(:,400)
i=1:400;
figure(1) 
plot(i,Theta(1,:),i,Theta(2,:),i,Theta(3,:),i,Theta(4,:)) 
title('待估参数过渡过程')