%==========================================
%最小二乘法辨识
% Z(k+2)=1.5*Z(k+1)-0.7*Z(k)+u(k+1)+0.5*u(k)+v(k)
%
%==========产生 M 序列作为输入===============
x=[0 1 0 1 1 0 1 1 1]; %initial value
n=403; %n 为脉冲数目
M=[]; %存放 M 序列
for i=1:n
temp=xor(x(4),x(9));
M(i)=x(9);
for j=9:-1:2
x(j)=x(j-1);
end
x(1)=temp;
end
%产生均值为 0，方差为 1 的高斯白噪声
v=randn(1,400);
z=[];
z(1)=-1;
z(2)=0;
for i=3:402
z(i)=1.5*z(i-1)-0.7*z(i-2)+M(i-1)+0.5*M(i-2)+v(i-2);
end
H=zeros(400,4);
for i=1:400
H(i,1)=-z(i+1);
H(i,2)=-z(i);
H(i,3)=M(i+1);H(i,4)=M(i);
end
Estimate=inv(H'*H)*H'*(z(3:402))'