%增广最小二乘的递推算法辨识对象
%Z(k+2)=1.5*Z(k+1)-0.7*Z(k)+u(k+1)+0.5*u(k)-v(k+1)+0.2*v(k)
%========================================
clear 
clc
%==========产生M序列作为输入===============
x=[0 1 0 1 1 0 1 1 1];  %initial value
n=403; %n为脉冲数目
M=[];	%存放M 序列
for i=1:n 
    temp=xor(x(4),x(9));
    M(i)=x(9);
for j=9:-1:2
x(j)=x(j-1);
end
x(1)=temp;
 end 
%===========产生均值为0，方差为1 的高斯白噪声=========
v=randn(1,402);
%==============产生观测序列z=================
z=zeros(402,1);
z(1)=-1;
z(2)=0;
for i=3:402
z(i)=1.5*z(i-1)-0.7*z(i-2)+M(i-1)+0.5*M(i-2)-v(i-1)+0.2*v(i-2);
end
%递推求解
P=100*eye(6);	%估计方差 
Theta=zeros(6,401);  %参数的估计值，存放中间过程估值 
Theta(:,1)=[3;3;3;3;3;3];
% K=zeros(4,400);	%增益矩阵
K=[10;10;10;10;10;10];
for i=3:402
h=[-z(i-1);-z(i-2);M(i-1);M(i-2);v(i-1);v(i-2)];
K=P*h*inv(h'*P*h+1);
Theta(:,i-1)=Theta(:,i-2)+K*(z(i)-h'*Theta(:,i-2));
P=(eye(6)-K*h')*P;
end
%=======================================================================
disp('参数a1、a2、b1、b2、d1、d2估计结果：') 
Theta(:,401)
i=1:401;


x=get(gca,'xlim');
A1=-1.5;
A2=0.7;
B1=1;
B2=0.5;
D1=-1;
D2=0.2;
hold on
plot(x,[A1 A1])
plot(x,[A2 A2])
plot(x,[B1 B1])
plot(x,[B2 B2])
plot(x,[D1 D1])
plot(x,[D2 D2])
figure(1)
plot(i,Theta(1,:),i,Theta(2,:),i,Theta(3,:),i,Theta(4,:),i,Theta(5,:),i,Theta(6,:))
title('待估参数过渡过程')
